Repository: educorvi/flutter_json_form
Catalog: demo/lib/l10n/app_*.arb
Languages: de

# navExamples
source: Examples
de: Beispiele

# navCustomForm
source: Custom Form
de: Eigenes Formular

# navSettings
source: Settings
de: Einstellungen

# settingsTitle
source: Settings
de: Einstellungen

# settingsFormDesignSystem
source: Form Design System
de: Formular-Designsystem

# settingsFormDesignSystemDesc
source: Select the design system for form rendering
de: Wähle das Designsystem für die Formulardarstellung

# designSystemGoogleMaterialDesc
source: Standard Material Design components
de: Standard Material Design Komponenten

# designSystemUVCooperativeDesc
source: Custom UV Cooperate design system
de: Benutzerdefiniertes UV Cooperate Designsystem

# settingsThemeMode
source: Theme Mode
de: Farbmodus

# settingsThemeModeDesc
source: Select the color theme for the app
de: Wähle das Farbthema für die App

# themeModeLight
source: Light
de: Hell

# themeModeDark
source: Dark
de: Dunkel

# settingsLanguage
source: Language
de: Sprache

# settingsLanguageDesc
source: Select your preferred language
de: Wähle die bevorzugte Sprache

# languageEnglish
source: English
de: Englisch

# languageGerman
source: German
de: Deutsch

# settingsAccessibility
source: Accessibility
de: Barrierefreiheit

# settingsAccessibilityDesc
source: Enable accessibility inspector to test your forms
de: Aktiviere den Barrierefreiheitsinspektor, um Formulare zu testen

source: Accessibility Inspector
de: Barrierefreiheitsinspektor

# accessibilityInspectorDesc
source: Show accessibility overlay with tap areas and semantics
de: Barrierefreiheits-Overlay mit Tap-Bereichen und Semantik anzeigen

# settingsAbout
source: About
de: Über

# aboutAppDesc
source: A demonstration app for the Flutter JSON Forms package
de: Eine Demonstrations-App für das Flutter JSON Forms Paket

# aboutViewOnGitHub
source: View on GitHub
de: Auf GitHub ansehen

source: Preset Data
de: Initialdaten

source: Show Form Data
de: Formulardaten anzeigen

source: Reset Form
de: Formular zurücksetzen

source: Show JSON Schema
de: JSON Schema anzeigen

source: Show UI Schema
de: UI Schema anzeigen

source: Select Form
de: Formular auswählen

source: Copy
de: Kopieren

source: Close
de: Schließen

source: JSON Schema File
de: JSON Schema Datei

source: UI Schema File
de: UI Schema Datei

source: Load Files
de: Dateien laden

source: Load Schemas
de: Schemas laden

# errorLoadingSchemas
source: Error loading schemas: {error}
de: Fehler beim Laden der Schemas: {error}

source: Schemas loaded successfully!
de: Schemas erfolgreich geladen!

# errorParsingJson
source: Error parsing JSON: {error}
de: Fehler beim Parsen von JSON: {error}

source: Please select both schema files
de: Bitte wählen Sie beide Schema-Dateien aus

source: Files loaded successfully!
de: Dateien erfolgreich geladen!

# errorLoadingFiles
source: Error loading files: {error}
de: Fehler beim Laden der Dateien: {error}
